torvalds/linux/drivers/net/wireless/rockchip_wlan/rtl8723cs/core/rtw_wnm.c
	/* STA BSS Transition Candidate List provided,
		and at least one NB report exist */
	if (((prsp->status == 0) || (prsp->status == 6)) && (frame_len >= 23)) {
		struct wnm_btm_cant cant;
		u8 *ptr, *pend;
		u32 idx = 0;

		ptr = pframe + 5;
		if (prsp->status == 0)
			ptr += ETH_ALEN;

		pend = ptr + frame_len;
		prsp->candidates_num = 0;
		while (ptr < pend) {
			if (*ptr != RTW_WLAN_ACTION_WNM_NB_RPT_ELEM)
				break;
			_rtw_memset(&cant, 0, sizeof(cant));
			cant.nb_rpt.id = *ptr;
			cant.nb_rpt.len = *(ptr + 1);
			_rtw_memcpy(cant.nb_rpt.bssid, (ptr + 2), ETH_ALEN);
			cant.nb_rpt.bss_info = *((u32 *)(ptr + 8));
			cant.nb_rpt.reg_class = *(ptr + 12);
			cant.nb_rpt.ch_num = *(ptr + 13);
			cant.nb_rpt.phy_type= *(ptr + 14);

			if (*(ptr + 15) == WNM_BTM_CAND_PREF_SUBEID)
				cant.preference = *(ptr + 17);
			ptr = ptr + cant.nb_rpt.len + 2;
			if (prsp->pcandidates) {
				prsp->candidates_num++;
				_rtw_memcpy((prsp->pcandidates + sizeof(cant) * idx), &cant, sizeof(cant));
			}

			idx++;
			RTW_WNM_INFO("WNM: btm rsp candidate bssid("MAC_FMT
				") ,bss_info(0x%04X), reg_class(0x%02X), ch(%d),"
				" phy_type(0x%02X), preference(0x%02X)\n",
				MAC_ARG(cant.nb_rpt.bssid), cant.nb_rpt.bss_info,
				cant.nb_rpt.reg_class, cant.nb_rpt.ch_num,
				cant.nb_rpt.phy_type, cant.preference);
			if ((prsp->pcandidates) && (prsp->candidates_num > 0))
				RTW_WNM_DUMP("WNM candidates: ", prsp->pcandidates,
						(sizeof(struct wnm_btm_cant) * prsp->candidates_num));
		}
	}

}

void rtw_wnm_hdr_init(_adapter *padapter,
	struct xmit_frame *pactionframe, u8 *pmac,
	u8 action, u8 **pcontent)
{
	struct mlme_ext_priv *pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	struct pkt_attrib *pattrib;
	struct rtw_ieee80211_hdr *pwlanhdr;
	u16 *pfctrl;
	u8 category;

	pattrib = &(pactionframe->attrib);
	update_mgntframe_attrib(padapter, pattrib);
	_rtw_memset(pactionframe->buf_addr, 0, (WLANHDR_OFFSET + TXDESC_OFFSET));

	*pcontent = (u8 *)(pactionframe->buf_addr + TXDESC_OFFSET);
	pwlanhdr = (struct rtw_ieee80211_hdr *)(*pcontent);
	pfctrl = &(pwlanhdr->frame_ctl);
	*(pfctrl) = 0;

	_rtw_memcpy(pwlanhdr->addr1, pmac, ETH_ALEN);
	_rtw_memcpy(pwlanhdr->addr2, adapter_mac_addr(padapter), ETH_ALEN);
	_rtw_memcpy(pwlanhdr->addr3, get_my_bssid(&pmlmeinfo->network), ETH_ALEN);

	SetSeqNum(pwlanhdr, pmlmeext->mgnt_seq);
	pmlmeext->mgnt_seq++;
	set_frame_sub_type(*pcontent, WIFI_ACTION);

	*pcontent += sizeof(struct rtw_ieee80211_hdr_3addr);
	pattrib->pktlen = sizeof(struct rtw_ieee80211_hdr_3addr);

	category = RTW_WLAN_CATEGORY_WNM;
	*pcontent = rtw_set_fixed_ie(*pcontent, 1, &(category), &(pattrib->pktlen));
	*pcontent = rtw_set_fixed_ie(*pcontent, 1, &(action), &(pattrib->pktlen));
}

void rtw_wnm_build_btm_req_ies(_adapter *padapter,
	u8 **pframe, struct pkt_attrib *pattrib,
	struct btm_req_hdr *phdr, u8 *purl, u32 url_len,
	u8 *pcandidates, u8 candidate_cnt)
{
	int i;

	*pframe = rtw_set_fixed_ie(*pframe, 1,
				&phdr->dialog_token, &(pattrib->pktlen));
	*pframe = rtw_set_fixed_ie(*pframe, 1,
				&phdr->req_mode, &(pattrib->pktlen));
	*pframe = rtw_set_fixed_ie(*pframe, 2,
				(u8 *)&phdr->disassoc_timer, &(pattrib->pktlen));
	*pframe = rtw_set_fixed_ie(*pframe, 1,
				&phdr->validity_interval, &(pattrib->pktlen));

	if (phdr->req_mode & BSS_TERMINATION_INCLUDED) {
		*pframe = rtw_set_fixed_ie(*pframe, 1,
					&phdr->term_duration.id, &(pattrib->pktlen));
		*pframe = rtw_set_fixed_ie(*pframe, 1,
					&phdr->term_duration.len, &(pattrib->pktlen));
		*pframe = rtw_set_fixed_ie(*pframe, 8,
					(u8 *)&phdr->term_duration.tsf, &(pattrib->pktlen));
		*pframe = rtw_set_fixed_ie(*pframe, 2,
					(u8 *)&phdr->term_duration.duration, &(pattrib->pktlen));
	}

	if ((purl != NULL) && (url_len > 0) &&
		(phdr->req_mode & ESS_DISASSOC_IMMINENT)) {
		*pframe = rtw_set_fixed_ie(*pframe, 1,
					(u8 *)&url_len, &(pattrib->pktlen));
		*pframe = rtw_set_fixed_ie(*pframe,
					url_len, purl, &(pattrib->pktlen));
	}

	if ((pcandidates != NULL) && (candidate_cnt > 0)) {
		for (i=0; i<candidate_cnt; i++) {
			struct wnm_btm_cant *pcandidate = \
				((struct wnm_btm_cant *)pcandidates) + i;
			struct nb_rpt_hdr *prpt = &(pcandidate->nb_rpt);

			*pframe = rtw_set_fixed_ie(*pframe, 1,
						&pcandidate->nb_rpt.id, &(pattrib->pktlen));
			*pframe = rtw_set_fixed_ie(*pframe, 1,
						&pcandidate->nb_rpt.len, &(pattrib->pktlen));
			*pframe = rtw_set_fixed_ie(*pframe, ETH_ALEN,
						pcandidate->nb_rpt.bssid, &(pattrib->pktlen));
			*pframe = rtw_set_fixed_ie(*pframe, 4,
						(u8 *)&pcandidate->nb_rpt.bss_info, &(pattrib->pktlen));
			*pframe = rtw_set_fixed_ie(*pframe, 1,
						&pcandidate->nb_rpt.reg_class, &(pattrib->pktlen));
			*pframe = rtw_set_fixed_ie(*pframe, 1,
						&pcandidate->nb_rpt.ch_num, &(pattrib->pktlen));
			*pframe = rtw_set_fixed_ie(*pframe, 1,
						&pcandidate->nb_rpt.phy_type, &(pattrib->pktlen));
			*pframe = rtw_set_ie(*pframe, WNM_BTM_CAND_PREF_SUBEID, 1,
					(u8 *)&pcandidate->preference, &(pattrib->pktlen));
		}
	}

}

void rtw_wnm_issue_btm_req(_adapter *padapter,
	u8 *pmac, struct btm_req_hdr *phdr, u8 *purl, u32 url_len,
	u8 *pcandidates, u8 candidate_cnt)
{
	struct roam_nb_info *pnb = &(padapter->mlmepriv.nb_info);
	struct xmit_priv *pxmitpriv = &(padapter->xmitpriv);
	struct xmit_frame *pmgntframe;
	struct pkt_attrib *pattrib;
	u8 action, *pframe, dialog_token = 0;

	if (!pmac || is_zero_mac_addr(pmac)
		|| is_broadcast_mac_addr(pmac))
		return ;

	if ((pmgntframe = alloc_mgtxmitframe(pxmitpriv)) == NULL)
		return ;

	rtw_wnm_hdr_init(padapter, pmgntframe, pmac,
		RTW_WLAN_ACTION_WNM_BTM_REQ, &pframe);

	pattrib = &(pmgntframe->attrib);
	rtw_wnm_build_btm_req_ies(padapter, &pframe, pattrib,
		phdr, purl, url_len, pcandidates, candidate_cnt);

	if (0) {
		u8 *__p =  (u8 *)(pmgntframe->buf_addr + TXDESC_OFFSET);
		RTW_WNM_DUMP("WNM BTM REQ :", __p, pattrib->pktlen);
	}

	pattrib->last_txcmdsz = pattrib->pktlen;
	dump_mgntframe(padapter, pmgntframe);
	RTW_INFO("WNM: BSS Transition Management Request sent\n");
}

void rtw_wnm_issue_action(_adapter *padapter,
	u8 action, u8 reason, u8 dialog)
{
	struct mlme_priv *pmlmepriv = &(padapter->mlmepriv);
	struct xmit_priv *pxmitpriv = &(padapter->xmitpriv);
	struct mlme_ext_priv *pmlmeext = &(padapter->mlmeextpriv);
	struct mlme_ext_info *pmlmeinfo = &(pmlmeext->mlmext_info);
	struct xmit_frame *pmgntframe;
	struct rtw_ieee80211_hdr *pwlanhdr;
	struct pkt_attrib *pattrib;
	u8 category, termination_delay, *pframe, dialog_token = 0;
#ifdef CONFIG_RTW_MBO
	u8 mbo_trans_rej_res = 1;  /* Unspecified reason */
	u8 mbo_notif_req_type ;
#endif
	u16 *fctrl;

	if ((pmgntframe = alloc_mgtxmitframe(pxmitpriv)) == NULL)
		return ;
	
	pattrib = &(pmgntframe->attrib);
	update_mgntframe_attrib(padapter, pattrib);
	_rtw_memset(pmgntframe->buf_addr, 0, (WLANHDR_OFFSET + TXDESC_OFFSET));

	pframe = (u8 *)(pmgntframe->buf_addr + TXDESC_OFFSET);
	pwlanhdr = (struct rtw_ieee80211_hdr *)pframe;

	fctrl = &(pwlanhdr->frame_ctl);
	*(fctrl) = 0;

	_rtw_memcpy(pwlanhdr->addr1, get_my_bssid(&pmlmeinfo->network), ETH_ALEN);
	_rtw_memcpy(pwlanhdr->addr2, adapter_mac_addr(padapter), ETH_ALEN);
	_rtw_memcpy(pwlanhdr->addr3, get_my_bssid(&pmlmeinfo->network), ETH_ALEN);

	SetSeqNum(pwlanhdr, pmlmeext->mgnt_seq);
	pmlmeext->mgnt_seq++;
	set_frame_sub_type(pframe, WIFI_ACTION);

